# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024] # summary: 260 layers, 2,572,280 parameters, 2,572,280 gradients, 6.1 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs
  #m: [0.50, 1.00, 512] # summary: 280 layers, 21,896,248 parameters, 21,896,248 gradients, 75.4 GFLOPs
  #l: [1.00, 1.00, 512] # summary: 392 layers, 26,299,704 parameters, 26,299,704 gradients, 93.8 GFLOPs
  #x: [1.00, 1.50, 512] # summary: 392 layers, 58,993,368 parameters, 58,993,368 gradients, 209.5 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CoordinationAttention, [512]] # Refine P3 with spatial awareness
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, CoordinationAttention, [512]] # Refine P3 with spatial awareness
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]        # ✅ P4 (after CA)
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]        # ✅ P3 (after CA)
  - [-1, 2, C3k2, [256, True]]       # P3 output

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]       # head P4
  - [-1, 2, C3k2, [512, True]]       # P4 output

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # ✅ P5 (after PSA)
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]



# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]] # 2
#   - [-1, 1, ECA, [256]]            # 3-P3/8 (Added Attention)
  
#   - [-1, 1, Conv, [256, 3, 2]]     # 4
#   - [-1, 2, C3k2, [512, False, 0.25]] # 5
#   - [-1, 1, ECA, [512]]            # 6-P4/16 (Added Attention)
  
#   - [-1, 1, Conv, [512, 3, 2]]     # 7
#   - [-1, 2, C3k2, [1024, True]]    # 8
#   - [-1, 1, ECA, [1024]]           # 9-P5/32 (Added Attention)
  
#   - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
#   - [-1, 2, C2PSA, [1024]]         # 11

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
#   - [[-1, 6], 1, Concat, [1]]      # 13: cat backbone P4 (Now index 6)
#   - [-1, 2, C3k2, [512, True]]     # 14

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
#   - [[-1, 3], 1, Concat, [1]]      # 16: cat backbone P3 (Now index 3)
#   - [-1, 2, C3k2, [256, True]]     # 17 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]     # 18
#   - [[-1, 14], 1, Concat, [1]]     # 19: cat head P4 (Now index 14)
#   - [-1, 2, C3k2, [512, True]]     # 20 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]     # 21
#   - [[-1, 11], 1, Concat, [1]]     # 22: cat head P5 (Now index 11)
#   - [-1, 1, C3k2, [1024, True, 0.5, True]] # 23 (P5/32-large)

#   - [[17, 20, 23], 1, Detect, [nc]] # 24: Detect(P3, P4, P5)